Repository: AncientKira21/flashpipe
Catalog: app/FlashPipe/Localizable.xcstrings
Source language: en
Languages: es, my

source: Follow these steps to install a ROM using ADB Sideload: 1. Reboot to Recovery • Most devices: Power + Volume Up → Recovery Mode • Pixel/Stock Android: Recovery → Apply update → Apply from ADB • OrangeFox: Recovery → Settings → ADB & Sideload → Start Sideload • PBRP: Unsupported, try OrangeFox. 2. Enable ADB Sideload Mode • Select "Apply from ADB" in recovery. Disable FBE Instructions: • Go Back and re-enter sideload mode. • Download the FBE disabler zip online. • Click Disable FBE to flash the zip. Warnings: • This disables File-Based Encryption. • Data loss may occur on some ROMs.
es: Sigue estos pasos para instalar una ROM usando ADB Sideload: 1. Reinicia en Recovery • Mayoría de dispositivos: Encender + Subir volumen → Modo Recovery • Pixel/Stock Android: Recovery → Aplicar actualización → Aplicar desde ADB • OrangeFox: Recovery → Configuración → ADB & Sideload → Iniciar Sideload • PBRP: No es compatible, prueba OrangeFox. 2. Activar Modo ADB Sideload • Selecciona "Aplicar desde ADB" en recovery. Instrucciones para Desactivar FBE: • Vuelve atrás y reingresa al modo sideload. • Descarga el archivo zip para deshabilitar FBE en línea. • Pulsa Desactivar FBE para flashear el zip. Advertencias: • Esto deshabilita el Cifrado Basado en Archivos (FBE). • Puede ocurrir pérdida de datos en algunas ROMs.
my: ADB Sideload ကိုသုံးပြီး ROM ထည့်သွင်းရန် အောက်ပါအဆင့်များကို လိုက်နာပါ– ၁။ Recovery ကို ပြန်လည်စတင်ပါ • စက်အများစု– ပါဝါ + အသံအတိုးခလုတ်ကို နှိပ် → Recovery Mode • Pixel/Stock Android– Recovery → Apply update → Apply from ADB • OrangeFox– Recovery → Settings → ADB & Sideload → Start Sideload • PBRP– မပံ့ပိုးပါ၊ OrangeFox ကို စမ်းကြည့်ပါ။ ၂။ ADB Sideload Mode ကို ဖွင့်ပါ • recovery တွင် "Apply from ADB" ကို ရွေးချယ်ပါ။ FBE ပိတ်ရန် လမ်းညွှန်များ: • နောက်သို့ ပြန်သွားပြီး sideload mode ကို ပြန်ဝင်ပါ။ • FBE disabler zip ကို အွန်လိုင်းမှ ဒေါင်းလုဒ်လုပ်ပါ။ • zip ဖလက်ရှ်ရန် Disable FBE ကို နှိပ်ပါ။ သတိပေးချက်များ: • ၎င်းသည် File-Based Encryption ကို ပိတ်သွားမည်။ • ROM အချို့တွင် ဒေတာဆုံးရှုံးမှု ဖြစ်ပေါ်နိုင်သည်။

source: Follow these steps to install a ROM using ADB Sideload: 1. Reboot to Recovery • Most devices: Power + Volume Up → Recovery Mode • Pixel/Stock Android: Recovery → Apply update → Apply from ADB • OrangeFox: Recovery → Settings → ADB & Sideload → Start Sideload • PBRP: Unsupported, try OrangeFox. 2. Enable ADB Sideload Mode • Select "Apply from ADB" in recovery. Rooting Instructions: • Go Back and re-enter sideload mode. • Download Magisk or KernelSU from the official website. • Rename the .apk to .zip • Press “Install Magisk/KernelSU” above to flash it.
es: Sigue estos pasos para instalar una ROM usando ADB Sideload: 1. Reinicia en Recovery • Mayoría de dispositivos: Encender + Subir volumen → Modo Recovery • Pixel/Stock Android: Recovery → Aplicar actualización → Aplicar desde ADB • OrangeFox: Recovery → Configuración → ADB & Sideload → Iniciar Sideload • PBRP: No es compatible, prueba OrangeFox. 2. Activar Modo ADB Sideload • Selecciona "Aplicar desde ADB" en recovery. Instrucciones para Rootear: • Vuelve atrás y reingresa al modo sideload. • Descarga Magisk o KernelSU desde el sitio web oficial. • Cambia el nombre del .apk a .zip • Pulsa “Instalar Magisk/KernelSU” arriba para flashear.
my: ADB Sideload ကိုသုံးပြီး ROM ထည့်သွင်းရန် အောက်ပါအဆင့်များကို လိုက်နာပါ– ၁။ Recovery ကို ပြန်လည်စတင်ပါ • စက်အများစု– ပါဝါ + အသံအတိုးခလုတ်ကို နှိပ် → Recovery Mode • Pixel/Stock Android– Recovery → Apply update → Apply from ADB • OrangeFox– Recovery → Settings → ADB & Sideload → Start Sideload • PBRP– မပံ့ပိုးပါ၊ OrangeFox ကို စမ်းကြည့်ပါ။ ၂။ ADB Sideload Mode ကို ဖွင့်ပါ • recovery တွင် "Apply from ADB" ကို ရွေးချယ်ပါ။ Root လုပ်ရန် လမ်းညွှန်များ: • နောက်သို့ ပြန်သွားပြီး sideload mode ကို ပြန်ဝင်ပါ။ • တရားဝင် ဝက်ဘ်ဆိုဒ်မှ Magisk သို့မဟုတ် KernelSU ကို ဒေါင်းလုဒ်လုပ်ပါ။ • .apk ကို .zip ဟု နာမည်ပြောင်းပါ။ • အပေါ်ရှိ “Install Magisk/KernelSU” ကိုနှိပ်ပြီး ဖလက်ရှ်ပါ။

source: (Samsung-only) Download mode
es: (Solo Samsung) Modo Download
my: (Samsung အတွက်သာ) Download mode

source: About
es: Acerca de
my: အကြောင်း

source: About FlashPipe
es: Acerca de FlashPipe
my: FlashPipe အကြောင်း

source: ADB Devices
es: Dispositivos ADB
my: ADB စက်များ

source: ADB Setup Instructions
es: Instrucciones de Configuración ADB
my: ADB စနစ်ထည့်သွင်းမှု လမ်းညွှန်များ

source: ADB Sideload Instructions
es: Instrucciones de ADB Sideload
my: ADB Sideload လမ်းညွှန်များ

source: App will reboot your device into bootloader. You will have to flash a custom recovery of your choice tht is made for your device in order to flash a custom ROM. For a GSI, you will need a GSI of your choice. If your ROM has got individual images, the app will handle them. Continue?
es: La aplicación reiniciará su dispositivo en el bootloader. Deberá flashear un custom recovery de su elección hecho para su dispositivo para poder flashear una custom ROM. Para una GSI, necesitará una GSI de su elección. Si su ROM tiene imágenes individuales, la aplicación las manejará. ¿Continuar?
my: အက်ပ်သည် သင့်စက်ကို bootloader ထဲသို့ ပြန်လည်စတင်မည်။ custom ROM ဖလက်ရှ်ရန်အတွက် သင့်စက်အတွက် ပြုလုပ်ထားသော custom recovery ကို ရွေးချယ်ပြီး ဖလက်ရှ်ရမည်။ GSI အတွက် သင်ရွေးချယ်ထားသော GSI လိုအပ်မည်။ သင့် ROM တွင် ပုံများ တစ်ခုချင်းစီ ပါရှိပါက၊ အက်ပ်က ၎င်းတို့ကို ကိုင်တွယ်မည်။ ဆက်လုပ်မလား?

source: Cancel
es: Cancelar
my: ပယ်ဖျက်မည်

source: Checking Tools…
es: Comprobando herramientas…
my: ကိရိယာများကို စစ်ဆေးနေသည်…

source: Close
es: Cerrar
my: ပိတ်မည်

source: Coming Soon!
es: ¡Próximamente!
my: မကြာမီလာမည်!

source: Continue
es: Continuar
my: ဆက်လုပ်မည်

source: Continue & Reboot to Bootloader
es: Continuar y Reiniciar en Bootloader
my: ဆက်လုပ်ပြီး Bootloader သို့ ပြန်လည်စတင်ပါ

source: Continue & Reboot to Download Mode
es: Continuar y Reiniciar en Modo Download
my: ဆက်လုပ်ပြီး Download Mode သို့ ပြန်လည်စတင်ပါ

source: Credits
es: Créditos
my: ဂုဏ်ပြုမှတ်တမ်းများ

source: Custom recovery flashed. Reboot to recovery?
es: Custom recovery flasheado. ¿Reiniciar en recovery?
my: Custom recovery ဖလက်ရှ်ပြီးပါပြီ။ recovery သို့ ပြန်လည်စတင်မလား?

source: Device
es: Dispositivo
my: စက်

source: Device Detected
es: Dispositivo Detectado
my: စက်ကို တွေ့ရှိပြီ

source: Devices Detected
es: Dispositivos Detectados
my: စက်များကို တွေ့ရှိပြီ

source: Disable FBE
es: Deshabilitar FBE
my: FBE ကို ပိတ်ပါ

source: Disable FBE Instructions
es: Instrucciones para Deshabilitar FBE
my: FBE ပိတ်ရန် လမ်းညွှန်များ

source: Dismiss
es: Descartar
my: ပယ်ဖျက်ပါ

source: Do not disconnect your device.
es: No desconectes tu dispositivo.
my: သင့်စက်ကို ချိတ်ဆက်မှု မဖြုတ်ပါနှင့်။

source: Download Mode
es: Modo Download

source: Fastboot Setup Instructions
es: Instrucciones de Configuración Fastboot
my: Fastboot စနစ်ထည့်သွင်းမှု လမ်းညွှန်များ

source: Flash
es: Flashear
my: ဖလက်ရှ်

source: Flash ROM
es: Flashear ROM
my: ROM ဖလက်ရှ်ပါ

source: Flash…
es: Flasheando…
my: ဖလက်ရှ်နေသည်…

source: Flashing Failed
es: Flasheo Fallido
my: ဖလက်ရှ်ခြင်း မအောင်မြင်ပါ

source: Flashing…
es: Flasheando…
my: ဖလက်ရှ်နေသည်…

source: Go to Fastboot
es: Ir a Fastboot
my: Fastboot သို့ သွားပါ

source: Go to Settings
es: Ir a Configuración
my: စနစ်ထည့်သွင်းမှုသို့ သွားပါ

source: GSI Flash Failed
es: Flasheo de GSI Fallido
my: GSI ဖလက်ရှ်ခြင်း မအောင်မြင်ပါ

source: Install Failed
es: Instalación Fallida
my: ထည့်သွင်းခြင်း မအောင်မြင်ပါ

source: Install Magisk/KernelSU
es: Instalar Magisk/KernelSU
my: Magisk/KernelSU ကို ထည့်သွင်းပါ

source: Install Tools
es: Instalar Herramientas
my: ကိရိယာများ ထည့်သွင်းပါ

source: Install tools to start fixing your devices!
es: ¡Instala las herramientas para empezar a arreglar tus dispositivos!
my: သင့်စက်များကို စတင်ပြင်ဆင်ရန် ကိရိယာများ ထည့်သွင်းပါ။

source: Installation failed
es: Instalación fallida
my: ထည့်သွင်းခြင်း မအောင်မြင်ပါ

source: Installing Tools…
es: Instalando herramientas…
my: ကိရိယာများ ထည့်သွင်းနေသည်…

source: Language
es: Idioma
my: ဘာသာစကား

source: Language changed
es: Idioma cambiado
my: ဘာသာစကား ပြောင်းလဲပြီး

source: My device is bricked, and I want to unbrick it
es: Mi dispositivo está brickeado, y quiero desbrickearlo
my: ကျွန်ုပ်၏စက်သည် ပျက်စီးနေပြီး ပြန်လည်ပြင်ဆင်လိုပါသည်

source: My device is running, but I want to MOD it
es: Mi dispositivo está funcionando, pero quiero MODificarlo
my: ကျွန်ုပ်၏စက်သည် အလုပ်လုပ်နေသော်လည်း MOD လုပ်ချင်သည်

source: No device selected
es: Ningún dispositivo seleccionado
my: စက် ရွေးချယ်ထားခြင်း မရှိပါ

source: No devices detected
es: No se detectaron dispositivos
my: စက်များကို တွေ့ရှိခြင်း မရှိပါ

source: No devices found.
es: No se encontraron dispositivos.
my: စက်များ မတွေ့ရှိပါ။

source: Normal Reboot
es: Reiniciar Normal
my: ပုံမှန် ပြန်လည်စတင်ခြင်း

source: OK
es: Aceptar
my: အိုကေ

source: Please ensure your Android device is connected and in fastboot mode.
es: Asegúrate de que tu dispositivo Android esté conectado y en modo fastboot.
my: သင့် Android စက်ကို ချိတ်ဆက်ထားပြီး fastboot mode တွင် ရှိနေကြောင်း သေချာပါစေ။

source: Please ensure your Android device is connected and in sideload mode.
es: Asegúrate de que tu dispositivo Android esté conectado y en modo sideload.
my: သင့် Android စက်ကို ချိတ်ဆက်ထားပြီး sideload mode တွင် ရှိနေကြောင်း သေချာပါစေ။

source: Please ensure your Android device is connected and USB debugging is enabled.
es: Asegúrate de que tu dispositivo Android esté conectado y la depuración USB esté habilitada.
my: သင့် Android စက်ကို ချိတ်ဆက်ထားပြီး USB debugging ကို ဖွင့်ထားကြောင်း သေချာပါစေ။

source: Reboot
es: Reiniciar
my: ပြန်လည်စတင်ပါ

source: Reboot to System
es: Reiniciar en el Sistema
my: စနစ်သို့ ပြန်လည်စတင်ပါ

source: Reboot…
es: Reiniciando…
my: ပြန်လည်စတင်နေသည်…

source: Refresh
es: Actualizar
my: ပြန်လည်ဆန်းသစ်ပါ

source: Refresh devices
es: Actualizar dispositivos
my: စက်များ ပြန်လည်ဆန်းသစ်ပါ

source: Rooting Instructions
es: Instrucciones de Rooteo
my: Root လုပ်ရန် လမ်းညွှန်များ

source: Searching for devices…
es: Buscando dispositivos…
my: စက်များကို ရှာဖွေနေသည်…

source: Select a fastboot device
es: Seleccionar un dispositivo fastboot
my: fastboot စက်တစ်ခု ရွေးချယ်ပါ

source: Select Device
es: Seleccionar Dispositivo
my: စက် ရွေးချယ်ပါ

source: Selected:
es: Seleccionado:
my: ရွေးချယ်ထားသည်:

source: Settings…
es: Configuración…
my: စနစ်ထည့်သွင်းမှုများ…

source: Sidebar
es: Barra lateral
my: ဘေးဘောင်

source: Start
es: Iniciar
my: စတင်

source: Supported Languages
es: Idiomas Soportados
my: ပံ့ပိုးထားသော ဘာသာစကားများ

# Version %@ (%@)
source: Version %1$@ (%2$@)
es: Versión %1$@ (%2$@)
my: ဗားရှင်း %1$@ (%2$@)

source: WARNING: Flashing a GSI will wipe all data.
es: ADVERTENCIA: Flashear una GSI borrará todos los datos.
my: သတိပေးချက်– GSI ဖလက်ရှ်ခြင်းသည် ဒေတာအားလုံးကို ဖျက်ပစ်မည်။

source: Logo
my: လိုဂို
